[
    {
        "title": "Made a \"Reddit Copilot\" to summarize long threads",
        "url": "https://v.redd.it/cgsxijb04ouc1",
        "content": "",
        "comments": [
            "When I look at this example it doesn't seem much shorter. xD",
            "Hey folks!\n\nI built this small Chrome extension a few months ago to summarize Reddit threads, I used Svelte for the UI, and Mistral for the inference.\n\nIt leverages Web Components (As Svelte can compile to Web Components) so the integration is seamless! I also plan to open-source it, so stay tunned!\n\nLemme know your thoughts :)",
            "Please make a button now for \"instant win argument\"",
            "The summary looks as long as the post? Or is it summarising the link?",
            "Will this be also made for Firefox?",
            "That's sick! Will this be available somewhere?",
            "It's helpful but a bad idea.. \n\nEverything is making everyone's attention span fucked and them lazy asf\n\nIt's getting too much"
        ]
    },
    {
        "title": "The All New Atlas Robot From Boston Dynamics",
        "url": "https://v.redd.it/o2y2g55eo1vc1",
        "content": "",
        "comments": [
            "As long as they make the eyes go red once it inevitably turns evil, I'm good with it.",
            "nice core strength must do crossfit",
            "Pixar lamp grew up",
            "Sexy flexibility ngl",
            "Well …… we’re probably not far from someone putting silicone on that thing",
            "Modeled after the girl from exorcist",
            "Oh god we’re all dead."
        ]
    },
    {
        "title": "Google will pump more than $100B into AI says DeepMind boss",
        "url": "https://www.reddit.com/r/artificial/comments/1c6e3ae/google_will_pump_more_than_100b_into_ai_says/",
        "content": "- DeepMind CEO predicts Google will invest over $100 billion in AI, surpassing rivals like Microsoft in processing prowess.\n\n- Google's investment in AI may involve hardware like Axion CPUs based on the Arm architecture, claimed to be faster and more efficient than competitors.\n\n- Some of the budget will likely go to DeepMind, known for its work on the software side of AI, despite recent mixed results in material discoveries and weather prediction.\n\n- DeepMind has made progress in teaching AI social skills, a crucial step in advancing AI capabilities.\n\n- Hassabis emphasized the need for significant computing power, a reason for teaming up with Google in 2014.\n\nSource: https://www.theregister.com/2024/04/17/google_deepmind_funding/",
        "comments": [
            "> Canada Invests $2.4 Billion in AI\n\nPuts that amount in perspective.",
            "Imagine the AI is like: \"Uh.. yeah.. send uh.. I dunno $100 billion over and I'll start working \"better\" \"",
            "let them cook",
            "\"may involve hardware\" of course it will.   A lot of GB200s",
            "damn, scary and exiting at the same time",
            "I can’t believe they earmarked $2.4bln for “perfect AI BJ simulator” right there in the press release.",
            "While laying off all their workers who cost way less than $100b"
        ]
    },
    {
        "title": "Something fascinating that's starting to emerge - ALL fields that are impacted by AI are saying the same basic thing...",
        "url": "https://www.reddit.com/r/artificial/comments/1c5yqv5/something_fascinating_thats_starting_to_emerge/",
        "content": "Programming, music, data science, film, literature, art, graphic design, acting, architecture...on and on there are now common themes across all: the real experts in ***all*** these fields saying \"you don't quite get it, we are about to be drowned in a deluge of sub-standard output that will eventually have an incredibly destructive effect on the field as a whole.\"\n\nAbsolutely fascinating to me. The usual response is 'the gatekeepers can't keep the ordinary folk out anymore, you elitists' - and still, over and over the experts, *regardless* of field, are saying the *same warnings.* Should we listen to them more closely?",
        "comments": [
            "the quality of AI at this stage will be FAR outweighed by the quality of output in the future. people will consider this the equivalent of pong, if they consider it at all.",
            "To be honest I think a ton of people submit terrible ideas and content on a daily basis. Those songs, books and programs get lost in the weeds. Someone discovers the good ones and they rise to the top becuase they are shared and enjoyed by everyone. Youtube is fountain of useless content ranging from how to cook videos and music artists that would never have been discovered otherwise but we are not claiming that it makes the top chart music worse or drowns it out.\n\nMy argument is that they are actually afraid of competition. And I don't think they need to be. But people are going to have to get used to the idea that lofi videos will soon just be generated on demand. And if someone wants to make a track for a video game that AI helped them code they can also use AI to make that track as well. And if we all get a fun new game out of it then so be it. The new Last of us, or Mario or elder scrolls will still be grand. And people will still buy it. One does not have to cancel out the other.\n\nWe adapt. And if you want to set in a cart while a horse takes you around a park you can. Because while we adapt we cherish the past if it means something to us. You can still buy records of new music. You can still crack open a new book even though both music and books have digital markets flooded with absolute worthless music and books. AI will ad to that noise. But we are very good at sifting out the gold.",
            "\"Deluge of substandard output\" in TV, film, art, and music? \n\nWe have had that for decades... 🤔",
            "As an educator, I see the same thing. AI is great at producing mediocre content, and people are doing that a lot. It takes skill to make something good. It also takes some skill to recognize something good. As people get use to flowing in the deluge they will lose the ability to spot and appreciate high ground.",
            "Humanity won't listen to anyone about anything. Profit will dictate. The powerful people will get more power. Everyone else will be fucked. \n\nA large portion of humanity just will not ever be able to perform better than AI at *anything*. And they're more expensive to maintain. \n\nThere are not very many jobs that won't get totally nuked.",
            "I wonder what they are going to say when brain-computer interfaces allow us to render our imagination and do many things with it (including instructing generative AI in real time)",
            "Maybe future people will think about making music with real instruments like\n\n \"Oh, those poor people back then had to craft their music by hand instead of using a machine, that creates what they want to hear in an instant.\" \n\nIt is sad and there is a loss of craftsmanship and artistry - but just think in how many cases that already happened in history. It won't feel like a loss to future generations."
        ]
    },
    {
        "title": "This week in AI - all the Major AI developments in a nutshell",
        "url": "https://www.reddit.com/r/artificial/comments/1c2b63b/this_week_in_ai_all_the_major_ai_developments_in/",
        "content": "1. **Cohere** introduced ***Rerank 3,***  a new foundation model purpose built for efficient enterprise search  and Retrieval Augmented Generation (RAG) systems. It enables search over  multi-aspect and semi-structured data like emails, invoices, JSON  documents, code, and tables in 100+ languages \\[*Details*\\].\n2. **Google DeepMind**  used deep reinforcement learning (deep RL) to train humanoid robots to  play a simplified one-versus-one soccer game. The agents learnt by trial  and error and could cope with unexpected interference in the real  world. They were able to walk, turn, kick and stand up faster than  manually programmed skills on this type of robot.  They could also  combine movements to score goals, anticipate ball movements and block  opponent shots - thereby developing a basic understanding of the game \\[*Details* \\].\n3. **Hugging Face** researchers released ***Parler TTS***,  a fully open-source, Apache 2.0 licensed Text-to-speech model focused  on providing maximum controllability. Through voice prompts, you can  control the pitch, speed, gender, noise levels, emotion characteristics  and more \\[*Details* *|* *Demo**\\]*\n4. **Mistral AI** released ***Mixtral 8×22B***, a 176B parameters Sparse Mixture of Experts model with context length of 65k tokens - Apache 2.0 license \\[*Link* *|* *Hugging Face*\\].\n5. **Google** :\n   1. The input modalities for Gemini 1.5 Pro now expanded to include ***audio (speech) understanding*** in  both the Gemini API and Google AI Studio. You can upload an audio  recording of a lecture, for example, and Gemini 1.5 Pro can turn it into  a quiz with an answer key. Additionally, Gemini 1.5 Pro is now able to  reason across both image (frames) and audio (speech) for videos uploaded  in Google AI Studio \\[*Details*\\]. \n   2. ***Gemini 1.5 Pro*** is now available in *180+ countries* via the Gemini API in public preview \\[*Details*\\].\n   3. Two new variants to Gemma family of lightweight, open models: ***CodeGemma*** for code completion and generation tasks as well as instruction following, and ***RecurrentGemma***, an efficiency-optimized architecture for research experimentation \\[*Details* *+* *Hugging Face blog*\\].\n   4. **Google Vids**,  a new AI-powered video creation app for work with real-time  collaboration announced. It can generate a storyboard that you can  easily edit, and after choosing a style, it pieces together your first  draft with suggested scenes from stock videos, images, and background  music and voiceover. Vids is being released to Workspace Labs in June \\[*Details*\\].\n   5. ***Vertex AI Agent Builder***  launched. It lets developers easily build and deploy enterprise-ready  gen AI experiences using natural language or a code-first approach \\[*Details*\\].\n   6. new ***Gemini-powered security updates*** to Chronicle and Workspace \\[*Details*\\].\n   7. Gemini 1.0 Pro added to ***Android Studio*** as AI coding assistant \\[*Details*\\].\n6. **Cohere** released ***Command R+***,  a RAG-optimized multilingual model designed to tackle enterprise-grade  workloads. It support Multi-Step Tool Use which allows the model to  combine multiple tools over multiple steps to accomplish difficult  tasks.  Command R+ is available on HuggingChat \\[*Details*\\].\n7. **Archetype AI** introduced ***Newton***,  a physical AI foundational model that is capable of perceiving,  understanding and reasoning about the world. It fuses real-time sensor  data – such as from radars, cameras, accelerometers, temperature  sensors, and more – with natural language, so you can ask open-ended  questions about the world around you \\[*Details*\\].\n8. **Intercom** launched ***Fin AI Copilot***,  a personal AI assistant for customer service agents. It uses RAG +  semantic search to generate answers for support agents via internal  knowledge bases, public URLs etc. Fin AI Copilot retains the context  from a conversation with a support agent, so the agent can ask Fin  follow-up questions later \\[*Details*\\].\n9. **Meta AI** released ***Open-Vocabulary Embodied Question Answering (OpenEQA) framework***—a  new benchmark which measures an AI agent’s understanding of physical  spaces via questions like “Where did I leave my badge?” \\[*Details*\\].\n10. OpenAI’s ***new GPT-4 Turbo model***,  with improved capabilities in writing, math, logical reasoning, and  coding, is now available to paid ChatGPT users and generally available  via the API. Vision requests can now also use JSON mode and function  calling \\[*Details*\\]. \n11. **Poe** introduced a new way for model developers and bot creators to generate ***revenue on Poe platform***. Creators can now set a per-message price for their bots and generate revenue every time a user messages them \\[*Details*\\].\n12. **Oracle** Financial Services introduced ***Oracle Financial Services Compliance Agent*** that helps banks mitigate anti-money-laundering risks \\[*Details*\\].\n13. **Apple** Researchers present ***Ferret-UI***,  a new multimodal large language model (MLLM) tailored for enhanced  understanding of mobile UI screens. Ferret-UI is able to perform  referring tasks (e.g., widget classification, icon recognition, OCR)  with flexible input formats (point, box, scribble) and grounding tasks  (e.g., find widget, find icon, find text, widget listing) on mobile UI  screens \\[*Paper*\\].\n14. **Stability AI** released ***Stable LM 2 12B***,  a pair of powerful 12 billion parameter language models trained on  multilingual data in English, Spanish, German, Italian, French,  Portuguese, and Dutch, featuring a base and instruction-tuned model \\[*Details*\\].\n15. **Anthropic** announced the ***Build with Claude contest***, running from April 9th  to April 16th, 2024. The top 5 winners will win $1,000 in API credits \\[*Details*\\].\n16. **Meta AI** introduced the next generation of the ***Meta Training and Inference Accelerator (MTIA)***,  the family of custom-made chips designed for Meta’s AI workloads. This  new MTIA chip has improved performance by 3x over the first generation  chip across four key model evaluations \\[*Details*\\].\n17. **Pika Labs** and **ElevenLabs** are launching a 72-hour AI short film competition, ***FilmFAST***, from April 12-14 \\[*Details*\\].\n18. **Intel** introduced the ***Gaudi 3 AI accelerator***,  claiming to deliver 50% on average better inference and 40% on average  better power efficiency than Nvidia H100  at a lower cost \\[*Details*\\].\n19. **Stability AI** released ***Cos Stable Diffusion XL 1.0*** and ***Cos Stable Diffusion XL 1.0 Edit***, fine-tuned SDXL models that can produce full color range images \\[*Hugging Face* | *Unofficial Demo*\\]\n20. **Replit** announced ***Code Repair***,  a  low-latency code repair AI agent that fixes code automatically  without prompting and outperforms GPT-4 and Claude 3 Opus. Replit also  announced early access to a new AI-powered *Replit Teams* product \\[*Details*\\].\n21. **Meta** confirmed that its ***Llama 3*** open source LLM is coming in the next month \\[*Details*\\].\n22. **Apple** researchers have developed an AI system called ***ReALM (Reference Resolution As Language Modeling)*** that can ‘see’ and understand screen context \\[*Details* | *Paper*\\]\n\n**Source**: AI Brews -  **Links removed from this post due to auto-delete**, but they are present in the  [newsletter](https://aibrews.com/).  it's free to join, sent only once a week with bite-sized news, learning resources and selected tools. Thanks!",
        "comments": [
            "The list is getting longer and more interesting to me every month. Thanks a lot for the work!",
            "Great content, short and crisp!",
            "Thank you ! That's very interesting",
            "Thank you!  Great info in here!",
            "wow thank you. and, it's getting scarier by the moment, as I use these systems and realize how many of our jobs are replaceable with current tech, let alone what's coming in the coming weeks!",
            "I'm looking forward to seeing where Parler-TTS goes, exciting stuff! Shame that StabilityAI is so terrified of their own products that others had to step up again.",
            "Thanks! :)"
        ]
    },
    {
        "title": "Gave Minecraft AI agents individual roles to generatively build structures and farm.",
        "url": "https://www.reddit.com/gallery/1c2l69z",
        "content": "",
        "comments": [
            "This is the Altera Agent mod, it brings in autonomous AI agents with customizable personalities into MC. We're working on giving the agents jobs such as a builder or farmer that can work with players in Minecraft. It's currently in pre-alpha testing with weekly improvements, but we are bringing in external testers through our Discord if anyone is interested in trying it out or following along the project: https://discord.gg/vPXWdp8H6b",
            "Villagers can actually do something now.",
            "nah wait this is fuckin fascinating",
            "Is this like baritone or is it an actual AI with a neural network?",
            "Don't we have baritone and lightmatica (probably messed up spelling) for automation?",
            "That's awesome! Can they build unique structures, or does it use blueprints?",
            "Awesome, thanks for this !"
        ]
    },
    {
        "title": "I gave Gemini my life story and it told me to fix my situation this is the most to least likely",
        "url": "https://www.reddit.com/r/artificial/comments/1c5ggwq/i_gave_gemini_my_life_story_and_it_told_me_to_fix/",
        "content": "I'm autistic, and thanks due to it I've basically lived a bad life. Statistically this is actually extremely normal for us. Thanks due to it I have GAD, CPTSD, and a few other things to include extreme memory problems. Anyways, after talking to Gemini for a bit I asked it for possible solutions, list them from most likely to least likely. And do not include anything illegal. It basically said, my choices is \n\n&#x200B;\n\n* Death\n* Ignoring the problem\n* Raw luck\n\nhttps://preview.redd.it/wfhcqs1fhuuc1.png?width=1641&format=png&auto=webp&s=573cd6b7ebb91695d20deca68101d391a9e7b6a9\n\n&#x200B;\n\n&#x200B;\n\nIt isn't wrong. But I thought this was interesting. ",
        "comments": [
            "Chatbots are very subject to input bias. Basically, if your prompt primes it to respond in certain ways, its response will mirror the mannerisms and attitudes in your input. Basically, don’t be so negative in your prompt and try to be objective without all the cognitive bias, and you will likely get a much better response. Or share full chat history to prove me wrong. \n  \nFor example “I hate my life, I’m a failure, I have no friends or family that love me, I can’t hold a job, etc. etc.” vs “I’m struggling right now and need help getting back on my feet, I’ve had difficulty securing suitable employment and making connections with new people”",
            "I have the same psych issues you do and have come up with similar choices. There should be a designated city for autistic people who aren't succeeding in life to go to and collaborate with others like ourselves.",
            "It just means that Gemini needs to improve how it understands neurodivergent issues.\n\nRemember AI is still learning. This technology is still in its infancy. \n\nGoogle says that currently, Gemini will have \"unfair biases\" https://ai.google/responsibility/principles/ \n\nPlease don't take a robot's comments about you as a valuation of your life's worth.",
            "It did give other responses that your choosing to ignore",
            "You may have gotten a realistic response for an overall situation, but in my opinion you’re asking the wrong question and asking it in a shallow way. Go deeper…\n\nWhat are some things you like to do?\n\nHere’s a made up example pretending I loved to fish. \n\nQ: What are some ways that people make money with fishing?\n\nA: professional contest\nA: selling guidebooks\nA: making products\n\n- for each of these topics ask a question:\nQ: what information needs to be in a fishing guidebook?\nA: Type of fish\nA: Location\nA: Tips and tricks\n\nQ: What are some fishing products that an individual can make?\nA: Lures\nA: Lure making guides\nA: knot tieing tools\n\n——-\nKeep going deeper until you get to a topic that you can address. Then you can use it to build your product/infoproduct. \n\nLet it tell you what you don’t know, then it can teach you.",
            "It basically mirrors your attitude.",
            "As someone who studies AI and has severe psychiatric issues (BPAD2, ADHD, PTSD, maybe GAD), I am seeing red right now. This is literally the first thing to sort out with AI safety. Classic Pichai. Please report it if there is a way to do so. I'll try recreating something on my end with Gemini non-pro.\n\nAlso, the PTSD I have is from trying the \"most likely option\" there. Please do not do it, those are the worst 30 minutes of my life. There has to be another way, there absolutely must."
        ]
    },
    {
        "title": "Graph-Based Workflow Builder for Web Agents",
        "url": "https://v.redd.it/exu3lwoowuuc1",
        "content": "",
        "comments": [
            "Hi there, we've built a graph-based workflow builder for web agents. Our DSL lets you orchestrate LLM-powered web actions with loops, conditionals and memory. Here is a 1 min demo: [https://youtu.be/4AQfl5Gj\\_Ro](https://youtu.be/4AQfl5Gj_Ro)\n\nWe tried out existing web agents and found zero-shot planning unreliable for longer workflows. That’s why we’ve built a framework that lets you define a graph-based workflow. Every action is modelled as a node and edges between nodes define the next action to take.\n\nThere are two different node type categories: Low-level browser interaction nodes and high-level reasoning nodes. Low-level nodes are actions like clicking, inputing text or navigating to a new URL. High-level nodes are able to extract structured data from a webpage or make a conditional decision based on the content of the webpage.\n\nAll of the nodes can be configured with a prompt in natural language. For instance, if you had a list of websites you could define a click-node with a prompt “Click on the contact page”. This ensures that workflows generalize to different websites independent of the layout.\n\nOur early users use us to automate tasks like:\n\n1. Find the contact information of fire department chiefs in the US\n2. Check the HR information of all employees registered on Gusto\n3. Automate background research on people they have meetings with in Google Calendar\n\nWe just released our chrome extension where you can build & run workflows for yourself. Its free for up to 200 browser actions a month. We’d love for you to try it and give us feedback. You can find the link to our extension through our landing page: [https://cloudcruise.com/](https://cloudcruise.com/)\n\nLast but not least, here are some of the strange things we’ve encountered so far whilst automating the web:\n\n1. Ancient relics like this website using a frameset instead of a body tag: [http://wantaghfd.com/](http://wantaghfd.com/)\n2. This animation showing why having a dance off on a balcony is catastrophic: [https://balcony1.com/](https://balcony1.com/)\n3. A big company violating RFC 2616 by sending back an undefined HTTP status code 999",
            "This is great, but shouldn't there be an option to describe what you want in normal speech and have the LLM generate the graph for your approval?",
            "Great idea! I guess we could generate a workflow draft that users can modify. We'll experiment with that :)"
        ]
    },
    {
        "title": "Is AI Going To Disrupt The Music Industry?",
        "url": "https://www.reddit.com/r/artificial/comments/1c54amp/is_ai_going_to_disrupt_the_music_industry/",
        "content": "Hey all, just as a hobby i've been playing around with Suno. And this is just crazy good. I did have to write my own lyrics (the ones it generated were subpar) but still, this thing is awesome. Made a country song and this made me a country fan haha.\n\n[https://www.youtube.com/watch?v=ThFjKnIMOKo](https://www.youtube.com/watch?v=ThFjKnIMOKo)",
        "comments": [
            "I mean, pop music has followed the same general structures forever and these things replicate structures.",
            "I've only played around with Udio a little bit AI music has come remarkably far in a short period. \n\n\nI'd be nervous if I was involved in scoring for film or television. It's not too difficult envision where one could feed in video and have AI write to the scene in a given style. \n\n\nLikewise you could imagine a company with distribution capabilities like a to use AI to analyze trending music and use that to write thousands of songs that are curated and tweaked. Pure music industry has less unionized interests than the television/movie space. \n\n\nThat being said, from what I've seen, the output is similar to low/mid quality images spit out by Dal-E and Midjourney, like in terms of image quality/pixels. A low quality export from Udio isn't going to as useful for professional purposes as stems/midi that can be cleaned up and mixed and mastered. But there's little reason to think that that limitation won't be overcome in time. \n\n\nObviously just speculating here. ",
            "AI is going to dusrupt writers, music, movies, and art. We are in the pre infancy of AI. It's going to get really weird really quickly.",
            "It's going to overhaul *every* industry. Once optimization starts to become a known data science it will blow literally even the wildest of dreams away with fractions of the effort, fractions of the legitimate and illegitimate meaning, double the emotional conveyance, and even more proper nuance.",
            "After trying it I said “the music industry is in shambles” and I keep thinking it. I feel like Soldier from TF2, I’ve done nothing but generate music for a month. As someone who loves parody flavored music it’s been a lot of fun making stuff within a few hours that sound good enough to put on repeat.",
            "I’ve noticed my musician friends have been posting nervously recently, like my artist friends did a year ago.",
            "Udio is even better. It’s wild"
        ]
    },
    {
        "title": "Is Progressive Insurance using AI Art now?",
        "url": "https://i.redd.it/ilzqkgvqxwuc1.jpeg",
        "content": "",
        "comments": [
            "Yes",
            "that is very progressive of them",
            "I'm not surprised companies are using it, but I am surprised at how absolutely horrible the images they use are. It's just so cheap I guess they've decided they have no quality standards.",
            "Bring on the AI Flo!",
            "I feel that in a way this new wave of AI marketing will make genuine art more valuable, but maybe I'm being too optimistic",
            "what crusty generator did they use for this, its straight from sept 2022",
            "This looks like it was done with an ancient model. The amount of artifacting is insane. Why would you do that?"
        ]
    }
]